Revit 2027 API
LoadCase.IsLoadCaseSubcategoryId Method
 Checks whether provided element ID refer to subcategory of Structural Load Cases (OST_LoadCases) category - one of built-in or user defined.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLoadCaseSubcategoryId(
	ElementId loadCaseSubcategoryId
)
Public Function IsLoadCaseSubcategoryId (
	loadCaseSubcategoryId As ElementId
) As Boolean
public:
bool IsLoadCaseSubcategoryId(
	ElementId^ loadCaseSubcategoryId
)
member IsLoadCaseSubcategoryId :
        loadCaseSubcategoryId : ElementId -> bool
Parameters
loadCaseSubcategoryId ElementId
 The ID to check.
Return Value
Boolean
 True if the ID refers to load case category element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Built-in structural Load Cases (OST_LoadCases) subcategories are: OST_LoadCasesDeadOST_LoadCasesLiveOST_LoadCasesWindOST_LoadCasesSnowOST_LoadCasesRoofLiveOST_LoadCasesAccidentalOST_LoadCasesTemperatureOST_LoadCasesSeismic
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace